{
  "flats": [
		{
			"img": "https://flatbook.by/img/flats/minsk/0b760117cb9c5b3a3c18fd84e.jpg",
			"tows": "Минск",
			"street": "ул. Одесская, 6",
			"district": "Автозаводская",
			"rooms": 2,
			"price": 350,
			"descr": "Квартиры от собственника Новостройка! Круглосуточно.от станции метро Автозаводская до дома 5 мин. От дома до ж/д вокзала 15 мин. Квартира с хорошим ремонтом и мебелью,чистая и уютная. Есть вся бытовая техника и гигиенические принадлежности, Wi-Fi, большой плазменный телевизор, двухспальная кровать с ортопедическим матрасом. Рядом институт МЧС, институт повышения квалификации, зоопарк, дельфинарий, универмаг 'Беларусь', 4-ая городская стоматология, стоматологическая клиника 'Варвашени 15', офтальмологическая клиника 'Новое зрение' и 'Оптимед'. Выдаются отчётные документы, звонки и заселение круглосуточно. Любая форма оплаты.Цена может меняться в зависимости от спроса ,а также в выходные и праздничные дни.",
			"numberOfPeople": 4,
			"id": 1
		},
		{
			"img": "https://flatbook.by/img/flats/minsk/m_m_m_5efc88967c453.jpg",
			"tows": "Минск",
			"street": "ул. Немига, 8",
			"district": "Немига",
			"rooms": 3,
			"price": 340,
			"descr": "проспект Победителей,1 (дом во дворе ул. Немига,8) Кондиционер. Новая просторная светлая квартира (новая мебель и ремонт). Центр. Станция метро Немига (1мин), рядом жд вокзал и проспект Победителей. В этом доме торг. центр 'На Немиге' в 1 минуте ходьбы Городская Ратуша, Дворец Спорта, крытый каток, выставочный комплекс цю 'БелЭКСПО', казино 'Эмир', 'Миллениум', ночные клубы, рестораны, кафе (Раковский бровар) торговые центры 'Galleria MinsK'. В квартире есть все необходимое для комфортного проживания (вся бытовая техника, WI-FI, спутниковое тв и постельное благоухающее белье, полотенца, гигиенические принадлежности, чай, кофе. В выходные и праздничные дни - цена договорная, цена зависит от количества проживающих. Оплата за использование кондиционера -дополнительная.",
			"numberOfPeople": 6,
			"id": 2
		},
		{
			"img": "https://flatbook.by/img/flats/minsk/60a0225c1f47e.jpeg",
			"tows": "Минск",
			"street": "ул. Тимирязева, 10",
			"district": "Центральный район",
			"rooms": 1,
			"price": 250,
			"descr": "Сдается уютная квартира-студия с новым ремонтом. Новый дом. В квартире имеется большая угловая ванная , в спальне установлен телевизор с выходом в интернет, а также новый ортопедический матрас для комфортного сна и удобный диван. Квартира находится в центре города. Рядом две станции метро (Фрунзенская и Молодежная). Стильная и комфортная квартира, в ней вы найдете все необходимое для комфортного проживания. Сдается на часы, сутки, недели, месяца. Квартира расположена в доме повышенной комфортности. На первом этаже продуктовый магазин и кафе. Исторический центр Минска, метро в шаговой доступности от самых интересных мест столицы. В квартире предоставлено все необходимое: белоснежное постельное белье и полотенца, махровые тапочки, интернет Wi-Fi, телевизор, микроволновая печь, электрочайник, фен, стиральная машина и т.д. Чистоту в квартире поддерживает горничная с опытом работы отеля 5*. Отчетные документы, трансфер. В выходные и праздничные дни, а также за проживание 4-х человек цена выше! Цена оговаривается! Регистрация заезда: 14.00, регистрация отъезда: 12.00 По предварительной договоренности, за дополнительную плату, возможен ранний заезд либо отъезд гостя.",
			"numberOfPeople": 4,
			"id": 3
		},
		{
			"img": "https://flatbook.by/img/flats/minsk/offer/bt0kne8a78oo40ok8cs00ko40.jpg",
			"tows": "Минск",
			"street": "ул. Янки Брыля, 7",
			"district": "Московский район",
			"rooms": 2,
			"price": 400,
			"descr": "Дополнительно: халаты - 10р, кальян - 30р . Метро Михалово и Петровщина. Большая джакузи для двоих( хромо-трубо-гидро-аэро терапия, есть балкон. В каждой комнате есть жк с приложением ivi, zala, смарт тв. Заезд с 13.30 и в любое время суток. Выезд до 12 дня. Часики 20 руб. Отчетные документы",
			"numberOfPeople": 4,
			"id": 4
		},
		{
			"img": "https://flatbook.by/img/flats/minsk/offer/604a1fe883c2a.jpg",
			"tows": "Минск",
			"street": "ул. Притыцкого, 158",
			"district": "Фрунзенский район",
			"rooms": 1,
			"price": 350,
			"descr": "Однокомнатная квартира с хорошим ремонтом в новом монолитном доме. В апартаментах есть все необходимое для комфортного проживания. Вся бытовая техника,Wi-Fi,всегда чистое белье,полотенца,гигиена,посуда,приборы. Две минуты до метро,рядом хорошо развитая инфраструктура, до центра города 7-10 минут. Цена может варьироваться, в зависимости от количества проживающих гостей и количества суток. Для постоянных гостей делаем скидки. При необходимости предоставим трансфер.",
			"numberOfPeople": 4,
			"id": 5
		},
		{
			"img": "https://flatbook.by/img/flats/minsk/full/61c9d0f2e2307.jpg",
			"tows": "Минск",
			"street": "ул. Сурганова, 30",
			"district": "Советский район",
			"rooms": 2,
			"price": 450,
			"descr": "Хорошая инфраструктура – экономия вашего времени. В шаговой доступности магазины, медицинские, банковские и образовательные учреждения. Любители ресторанной пищи могут посетить близлежащие заведения общественного питания. Недалеко Комаровский рынок. Удобный выезд на Логойский тракт – до центра и МКАД доберетесь быстро. Жилой комплекс удобно расположен рядом с деловыми и торговыми центрами Минска в экологически чистом районе без загрязняющих производств. Советский район. Документы для отчетности, квитанция. Оплата удобным для вас способом - нал./безнал. расчет, оплата на банковскую карту. Фото соответствуют. Можно еще много перечислять достоинства данной квартиры, но лучше арендовать и увидеть своими глазами!",
			"numberOfPeople": 6,
			"id": 6
		}
   ]
}


